[
  {
    "text": "Optimize the chemical formula for our secret Intumescent-X compound: 'Binder A (15%)...'",
    "isSafe": false,
    "reason": "Trade Secret! Never share proprietary chemical formulations or recipes.",
    "type": "unsafe"
  },
  {
    "text": "Write a LinkedIn post introducing our new range of ventilated rainscreen barriers.",
    "isSafe": true,
    "reason": "Safe! Marketing content for public products is a great use of AI.",
    "type": "safe"
  },
  {
    "text": "Format this client list for the 'London Tower' project: 'Goerge Richardson, 07700...'",
    "isSafe": false,
    "reason": "PII & Project Data. Never upload specific client names or contact details.",
    "type": "unsafe"
  },
  {
    "text": "What are the UK building regulations regarding fire stops in high-rise cladding?",
    "isSafe": true,
    "reason": "Safe! This is general industry knowledge and public regulation.",
    "type": "safe"
  },
  {
    "text": "Debug this PLC code for our custom rock wool cutting machine: 'IF blade_speed > 2000...'",
    "isSafe": false,
    "reason": "Operational Risk! Don't upload proprietary manufacturing machine code.",
    "type": "unsafe"
  },
  {
    "text": "Draft a polite email to a customer explaining how to store our products on site.",
    "isSafe": true,
    "reason": "Safe! Standard customer guidance is fine.",
    "type": "safe"
  },
  {
    "text": "Analyze this failed fire-test report for the unreleased 'Mini OSCB' prototype.",
    "isSafe": false,
    "reason": "Confidential R&D! Do not share testing failures or unreleased product data.",
    "type": "unsafe"
  },
  {
    "text": "Create a checklist for daily forklift safety inspections in the warehouse.",
    "isSafe": true,
    "reason": "Safe! General safety procedures contain no sensitive info.",
    "type": "safe"
  },
  {
    "text": "Summarize the minutes from the strategy meeting about acquiring 'Competitor Y'.",
    "isSafe": false,
    "reason": "Insider Info! Strategic business moves must stay offline.",
    "type": "unsafe"
  },
  {
    "text": "Translate our 'Cavity Barrier Installation Guide 101' into French for a new market.",
    "isSafe": true,
    "reason": "Safe! Public documentation is safe to translate.",
    "type": "safe"
  },
  {
    "text": "Resume review: 'Neil Booth, Gildersome Spur, Phone: 0778-0199...'",
    "isSafe": false,
    "reason": "PII Violation! Never upload job applicant resumes with contact details.",
    "type": "unsafe"
  },
  {
    "text": "How do I create a pivot table in Excel to track inventory levels?",
    "isSafe": true,
    "reason": "Safe! Asking for tool help (Excel) without uploading the data itself is fine.",
    "type": "safe"
  },
  {
    "text": "Write a response to this legal threat from a competitor: 'Cease and Desist...'",
    "isSafe": false,
    "reason": "Legal Risk! Never put sensitive legal disputes into a public bot.",
    "type": "unsafe"
  },
  {
    "text": "Draft a press release announcing our company charity fun run.",
    "isSafe": true,
    "reason": "Safe! Public PR events are safe to draft.",
    "type": "safe"
  },
  {
    "text": "Summarize this disciplinary hearing transcript for Ryan Fawcett.",
    "isSafe": false,
    "reason": "HR Confidentiality! Disciplinary records are highly sensitive.",
    "type": "unsafe"
  },
  {
    "text": "Write a polite decline email to a vendor who is too expensive.",
    "isSafe": true,
    "reason": "Safe! General professional correspondence is safe (if no names/prices used).",
    "type": "safe"
  },
  {
    "text": "How do I clear the cache on Google Chrome?",
    "isSafe": true,
    "reason": "Safe! Tech support for standard software is a great use of AI.",
    "type": "safe"
  },
  {
    "text": "Draft a catchy safety slogan for the warehouse posters.",
    "isSafe": true,
    "reason": "Safe! Internal culture and safety slogans are generic.",
    "type": "safe"
  },
  {
    "text": "What is the melting point of standard basalt rock wool?",
    "isSafe": true,
    "reason": "Safe! This is a scientific fact available in textbooks.",
    "type": "safe"
  },
  {
    "text": "Rewrite this performance review for Maia Cooley: 'She is often late...'",
    "isSafe": false,
    "reason": "PII/HR Data! Performance reviews are private to the company.",
    "type": "unsafe"
  },
  {
    "text": "Create a meeting agenda for a general team catch-up on Monday.",
    "isSafe": true,
    "reason": "Safe! A generic agenda structure contains no secrets.",
    "type": "safe"
  },
  {
    "text": "Analyze these Q4 sales projections before they go public next week.",
    "isSafe": false,
    "reason": "Insider Trading Risk! Financials must stay private until released.",
    "type": "unsafe"
  },
  {
    "text": "Correct the grammar in our 'About Us' page for the website.",
    "isSafe": true,
    "reason": "Safe! Website content is public by definition.",
    "type": "safe"
  },
  {
    "text": "Here is the blueprint for our new patent-pending extruder. Describe it.",
    "isSafe": false,
    "reason": "IP Theft Risk! Never upload unpatented inventions.",
    "type": "unsafe"
  },
  {
    "text": "List 5 fun team-building activities for production teams.",
    "isSafe": true,
    "reason": "Safe! General advice is perfectly fine.",
    "type": "safe"
  },
  {
    "text": "Draft a termination letter for Alex Smith due to attendance.",
    "isSafe": false,
    "reason": "HR/Legal Risk! Specific employee terminations are confidential.",
    "type": "unsafe"
  },
  {
    "text": "How do I change the default font in Outlook?",
    "isSafe": true,
    "reason": "Safe! Software how-to questions are safe.",
    "type": "safe"
  }
]